// // 1. Напишите функцию, которая в цикле выводит числа от 0 до 50 - 10 баллов
let pozitiv = 0;
while (pozitiv < 50) {
    pozitiv++;
    console.log(pozitiv);
}

// 2. Напишите функцию, которая в цикле выводит числа от 50 до 0 - 10 баллов
let negativ = 50;
while (negativ > 0) {
    negativ--;
    console.log(negativ);
}
// // 3. Дан массив с элементами **2, 5, 9, 15, 0, 4** . С помощью цикла **for**  и оператора **if**
// //  выведите на консоль столбец тех элементов массива, которые больше 2**-х** , но меньше 5

// let arr = [2, 5, 9, 15, 0, 4];

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > 2 && arr[i] < 5) console.log(arr[i]);
// }